using System.Collections.Generic;

namespace Nabedroid.XBooksReader.Common {

  public class StringUtil {

    private StringUtil() { }

    private static readonly Dictionary<string, string> _KatakanaGyou = new Dictionary<string, string> {
      { "ア", "ア" }, { "イ", "ア" }, { "ウ", "ア" }, { "エ", "ア" }, { "オ", "ア" },
      { "カ", "カ" }, { "キ", "カ" }, { "ク", "カ" }, { "ケ", "カ" }, { "コ", "カ" },
      { "サ", "サ" }, { "シ", "サ" }, { "ス", "サ" }, { "セ", "サ" }, { "ソ", "サ" },
      { "タ", "タ" }, { "チ", "タ" }, { "ツ", "タ" }, { "テ", "タ" }, { "ト", "タ" },
      { "ナ", "ナ" }, { "ニ", "ナ" }, { "ヌ", "ナ" }, { "ネ", "ナ" }, { "ノ", "ナ" },
      { "ハ", "ハ" }, { "ヒ", "ハ" }, { "フ", "ハ" }, { "ヘ", "ハ" }, { "ホ", "ハ" },
      { "マ", "マ" }, { "ミ", "マ" }, { "ム", "マ" }, { "メ", "マ" }, { "モ", "マ" },
      { "ヤ", "ヤ" }, { "ユ", "ヤ" }, { "ヨ", "ヤ" },
      { "ラ", "ラ" }, { "リ", "ラ" }, { "ル", "ラ" }, { "レ", "ラ" }, { "ロ", "ラ" },
      { "ワ", "ワ" }, { "ヲ", "ワ" }, { "ン", "ワ" },
      { "ガ", "カ" }, { "ギ", "カ" }, { "グ", "カ" }, { "ゲ", "カ" }, { "ゴ", "カ" },
      { "ザ", "サ" }, { "ジ", "サ" }, { "ズ", "サ" }, { "ゼ", "サ" }, { "ゾ", "サ" },
      { "ダ", "タ" }, { "ヂ", "タ" }, { "ヅ", "タ" }, { "デ", "タ" }, { "ド", "タ" },
      { "バ", "ハ" }, { "ビ", "ハ" }, { "ブ", "ハ" }, { "ベ", "ハ" }, { "ボ", "ハ" },
      // { "ヴ", "ハ" },
      { "パ", "ハ" }, { "ピ", "ハ" }, { "プ", "ハ" }, { "ペ", "ハ" }, { "ポ", "ハ" },
    };

    private static readonly Dictionary<string, string> _KatakanaRetsu = new Dictionary<string, string> {
      { "ア", "ア" }, { "イ", "イ" }, { "ウ", "ウ" }, { "エ", "エ" }, { "オ", "オ" },
      { "カ", "カ" }, { "キ", "キ" }, { "ク", "ク" }, { "ケ", "ケ" }, { "コ", "コ" },
      { "サ", "サ" }, { "シ", "シ" }, { "ス", "ス" }, { "セ", "セ" }, { "ソ", "ソ" },
      { "タ", "タ" }, { "チ", "チ" }, { "ツ", "ツ" }, { "テ", "テ" }, { "ト", "ト" },
      { "ナ", "ナ" }, { "ニ", "ニ" }, { "ヌ", "ヌ" }, { "ネ", "ネ" }, { "ノ", "ノ" },
      { "ハ", "ハ" }, { "ヒ", "ヒ" }, { "フ", "フ" }, { "ヘ", "ヘ" }, { "ホ", "ホ" },
      { "マ", "マ" }, { "ミ", "ミ" }, { "ム", "ム" }, { "メ", "メ" }, { "モ", "モ" },
      { "ヤ", "ヤ" }, { "ユ", "ユ" }, { "ヨ", "ヨ" },
      { "ラ", "ラ" }, { "リ", "リ" }, { "ル", "ル" }, { "レ", "レ" }, { "ロ", "ロ" },
      { "ワ", "ワ" }, { "ヲ", "ヲ" }, { "ン", "ン" },
      { "ガ", "カ" }, { "ギ", "キ" }, { "グ", "ク" }, { "ゲ", "ケ" }, { "ゴ", "コ" },
      { "ザ", "サ" }, { "ジ", "シ" }, { "ズ", "ス" }, { "ゼ", "セ" }, { "ゾ", "ソ" },
      { "ダ", "タ" }, { "ヂ", "チ" }, { "ヅ", "ツ" }, { "デ", "テ" }, { "ド", "ト" },
      { "バ", "ハ" }, { "ビ", "ヒ" }, { "ブ", "フ" }, { "ベ", "ヘ" }, { "ボ", "ホ" },
      // { "ヴ", "ハ" },
      { "パ", "ハ" }, { "ピ", "ヒ" }, { "プ", "フ" }, { "ペ", "ヘ" }, { "ポ", "ホ" },
   };

    public static readonly string[][] Gojuuon = new string[][] {
      new string[] { "ア", "イ", "ウ", "エ", "オ" },
      new string[] { "カ", "キ", "ク", "ケ", "コ" },
      new string[] { "サ", "シ", "ス", "セ", "ソ" },
      new string[] { "タ", "チ", "ツ", "テ", "ト" },
      new string[] { "ナ", "ニ", "ヌ", "ネ", "ノ" },
      new string[] { "ハ", "ヒ", "フ", "ヘ", "ホ" },
      new string[] { "マ", "ミ", "ム", "メ", "モ" },
      new string[] { "ヤ", "ユ", "ヨ" },
      new string[] { "ラ", "リ", "ル", "レ", "ロ" },
      new string[] { "ワ", "ヲ", "ン" },
    };

    // カタカナの先頭が何行（ア行、サ行等）か取得する
    public static string GetKanaGyou(string kana) {
      return kana == null || kana.Length < 1 || _KatakanaGyou.ContainsKey(kana[0].ToString()) ? null : _KatakanaGyou[kana[0].ToString()];
    }

    // カタカナの先頭が何列（イ列、フ列等）か取得する
    // 基本的には濁点をを除いた文字を返すだけ
    public static string GetKanaRetsu(string kana) {
      return kana == null || kana.Length < 1 || _KatakanaRetsu.ContainsKey(kana[0].ToString()) ? null : _KatakanaRetsu[kana[0].ToString()];
    }

  }

}